 <table width="100%" border="1">
  <tr> 
    <td width="23%"><div align="center"><strong>Camp</strong></div></td>
    <td width="77%"><div align="center"><strong>Descripci&oacute;</strong></div></td>
  </tr>
  <tr> 
    <td>Nivell autenticaci&oacute;</td>
    <td>Indica els nivells als que s'aplicacar&aacute; aquestes especificacions.<br>
      Un document se li requerir&agrave; a l'usuari segons el nivell d'autenticaci&oacute; 
      amb el que l'usuari inicie sessi&oacute; i els nivells que s'hajen especificat 
      per al document.</td>
  </tr>
  <tr> 
    <td>Versi&oacute;</td>
    <td>Indica la versi&oacute; del document. Tot document ha d'estar definit 
      en el RDS mitjantçant un model / versi&oacute;.</td>
  </tr>
  <tr> 
    <td>Obligatori</td>
    <td>Indica si el document ser&agrave; obligatori, opcional o dependr&agrave; 
      de dades introduïdes en formularis.</td>
  </tr>
  <tr> 
    <td>Script Obligatorietat</td>
    <td>Si el document és depenent, la seua dependència s'haurà d'indicar mitjantçant 
      aquest script. El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
      i espera com resultat: S, N o D.</td>
  </tr>
  <tr> 
    <td>Script flux tramitaci&oacute; <br></td>
    <td>Indica usuari que ha d'aportar aquest document (sol per a autenticat i 
      si aquesta habilitat el flux de tramitaci&oacute;). Si &eacute;s nul o retorna 
      buit ha d'aportar-lo qui inicia el tr&agrave;mit</td>
  </tr>
  <tr> 
    <td height="50">Signar digitalmente</td>
    <td>Indica si el document ha de ser signat per l'usuari després d'emplenar-lo 
      (formularis) o adjuntar-lo (annexe). El signant deur&agrave; dispondre de 
      certificat digital.</td>
  </tr>
  <tr> 
    <td>Camp DNI Signant</td>
    <td>Indica qui haurà de signar el document. Aquest camp és de tipus<a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a>.
    En cas de no indicar l'script el signant ser&agrave; qui inicia el tr&agrave;mit.
    </td>
  </tr>
  <tr> 
    <td>Content type firma</td>
    <td>Indica el content type del documento a firmar. Si no se especifica se 
      utilizar&aacute; uno por defecto.</td>
  </tr>
   <tr> 
    <td>Gestor de formularis</td>
    <td><p>Indica el gestor de formularis que es cridará (FORMS,etc)</p></td>
  </tr>
  <tr> 
    <td>Model - Versió</td>
    <td><p>Identifica en el gestor de formularis el model/versió del formulari. Per FORMS hi ha un botó de selecció.</p></td>
  </tr>  
  <tr> 
    <td>Script càrrega de dades inicials</td>
    <td><p>Per a formularis permet precarregar dades en el formulari (p.ex. nif 
        i nom de l'usuari). El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
        i no espera cap resultat.</p>
      <p>La forma de precarregar aquestes dades des del script és mitjançant el 
        plugin DATOSINICIALES:<em> <br>
      DATOSINICIALES.setDatoInicial('campo1','valor1');</em></p>
      <p><br>
        <em>NOTA: Actualment no es pot precarregar camps indexats (llistes, etc.)</em> </p>
    </td>
  </tr>
  <tr> 
    <td height="137">Script configuraci&oacute; de formularis</td>
        <td><p>Per a formularis permet: <br>
    	<ul>
    		<li>- bloquejar camps en un formulari (p.ex. si precarreguem nif del certificat no permitim editar-lo).</li>
        	<li>- establir propiedats específiques per al gestor de formularis. Per a FORMS disposem de las següents propietats: 
	        	<br> * pantallaFin.mostrar: (true/false) indica si es mostra la darrera pantalla de FORMS
	        	<br> * pantallaFin.titulo: permet establir el títol de la darrera pantalla de FORMS
	        	<br> * pantallaFin.texto: permet establir el texte de la darrera pantalla de FORMS
        	</li>
       </ul> 
       <p>
        El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
        i no espera cap resultat.</p>
      <p>La forma de precarregar aquesta configuraci&oacute; és mitjantçant el 
        plugin CONFIGURACIONFORMULARIO:
      	<em> <br>
        CONFIGURACIONFORMULARIO.setDatoSoloLectura('campo1');<br>
        CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.mostrar","true");
		CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.titulo",PLUGIN_MENSAJES.getMensaje("tituloFORMS"));
		CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.texto",PLUGIN_MENSAJES.getMensaje("textoFORMS"));   
		</em></p></td>
        
        
  </tr>
  <tr> 
    <td height="70">Script de validaci&oacute; de tornada de FORMS</td>
    <td>Per a formularis permet realitzar una validaci&oacute; sobre les dades 
      del formulari tornat per FORMS. El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
      i espera com resultat S en cas correcte i N en cas d'error.</td>
  </tr>
  <tr>
    <td height="60">Script de modificaci&oacute; de tornada de FORMS</td>
    <td>Per a formularis permet modificar dades d'altres formularis despr&eacute;s 
      de tornar de FORMS. Per a aix&ograve; es permet en el plugin de formularis accedir a un m&egrave;tod per establir dades en altres formularis:
      <em> <br>
       PLUGIN_FORMULARIOS.setDatoFormulario('FOR1',1,'campo1','valorCampo');        
        </em></td>
  </tr>
  <tr> 
    <td height="60">Script Plantilla</td>
    <td>Per a formularis permet establir la plantilla que s'haurà d'utilitzar 
      per a la seua visualitzaci&oacute;. El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
      i espera com resultat el codi de la plantilla. Si el script retorna cadena 
      buida ('') no s'utilitzará una plantilla especifica i s'utilitzarà la per 
      defecte. </td>
  </tr>
  <tr> 
    <td height="631">Script per a càlcul dades pagament</td>
    <td><p>Per a pagaments permet realitzar el c&agrave;lculo de la taxa a pagar. 
        El tipus d'aquest camp és <a class="enlaceAyuda" href="/sistraback/ayuda_ca/ayudaScript.jsp">script</a> 
        i no espera cap resultat.</p>
      <p>La forma d'indicar les dades del pagament és mitjantçant el plugin <em>DATOSPAGO</em>.</p>
      
      <p>Les dades obligat&ograve;ries s&oacute;n::<br>
      	<ul>
    		<li>Modelo: model de tasa (per defecte 046)</li>
    		<li>Id Tasa: identificador de la tasa</li>
    		<li>Concepto: concepte de la tasa (per defecte el t&iacute;tol del pagament)</li>
    		<li>Fecha devengo: data de c&aacute;lcul de la tasa en format YYYYMMMDD (per defecte la data actual)</li>
    		<li>Importe: import de la tasa en format cents (1 euro = 100 cents)</li>
    		<li>Nif: nif del declarant (per defecte el nif del representant)</li>
    		<li>Nombre: nom i llinatges del declarant (per defecte nom i llinatges del representant)</li>
    	</ul>
    	<br/>
    	Els m&egrave;tods disponibles son:<br/>    		
      	DATOSPAGO.setModelo('Modelo');<br>
        DATOSPAGO.setIdTasa('IdTasa');<br>
        DATOSPAGO.setConcepto('Concepto del pago');<br>
        DATOSPAGO.setFechaDevengo('Fecha');<br>
        DATOSPAGO.setImporte('Importe');<br>        
        DATOSPAGO.setNif('Nif');<br>
        DATOSPAGO.setNombre('Nombre');<br>
	  </p>
        
                
      <p> A m&eacute;s es dispondrà d'una funci&oacute; per a consultar l'importe 
        d'una taxa (en cents):<br>
        res = DATOSPAGO.consultarImporteTasa('idTasa')<em>;</em> // En cas d'error 
        torna -1<br/><br/>
        En cas que es necessitin passar par&agrave;metres a la funci&oacute; de consultar l'import es pot utilitzar la funci&oacute;:
        DATOSPAGO.establecerParametroCalculoTasa('nombreParametro','valorParametro');<br/><br/>
        D'aquesta forma es poden passar els par&agrave;metres necessaris per a realitzar el c&agrave;lcul. L'&uacute;s de paràmetres en el c&agrave;lcul de la taxa dependr&agrave; del plugin de pagament de l'organisme.         
        </p>
      <p>   Exemple complet:<em><br>
        </em><em>res = DATOSPAGO.consultarImporteTasa('1.2.6'); <br>
        if (res == -1) {<br>
        ERRORSCRIPT.setExisteError(true);<br>
        }else{<br>
        DATOSPAGO.setIdTasa('1.2.6');<br>
        DATOSPAGO.setImporte(res);<br>
        }<br>
        <br>
        </em></p></td>
  </tr>
  <tr> 
    <td height="56">Tipus de pagament</td>
    <td>Indica el tipus de pagament permés: Telem&agrave;tic / Presencial / Ambdós</td>
  </tr>
  <tr> 
    <td height="56">Informaci&oacute; adicional</td>
    <td>Permet sobreescriure per nivell d'autenticaci&oacute; la informaci&oacute; 
      espec&iacute;fica del document.</td>
  </tr>
</table>
