 <table width="100%" border="1">
  <tr> 
    <td width="22%"><div align="center"><strong>Campo</strong></div></td>
    <td width="78%"><div align="center"><strong>Descripci&oacute;n</strong></div></td>
  </tr>
  <tr> 
    <td>Tipo</td>
    <td>Indica si el documento es un Formulario, Anexo o Pago</td>
  </tr>
  <tr> 
    <td>Identificador</td>
    <td>Identificador del documento. Debe ser único entre los documentos del trámite.</td>
  </tr>
  <tr> 
    <td>Orden de presentaci&oacute;n</td>
    <td>Orden de presentaci&oacute;n en el asistente</td>
  </tr>
  <tr> 
    <td>Modelo</td>
    <td>Indica el modelo del documento. Todo documento debe estar definido en 
      el RDS mediante un modelo / versi&oacute;n. La versi&oacute;n se particulariza 
      seg&uacute;n nivel de autenticaci&oacute;n.</td>
  </tr>
  <tr> 
    <td>Identificador PAD</td>
    <td>Si el documento puede estar en la PAD se indicar&aacute; el identificador 
      interno de la PAD para ese documento. En la tramitaci&oacute;n se comprobar&aacute; 
      si el usuario tiene registrado dicho documento en la PAD y le dar&aacute; 
      opci&oacute;n a reutilizarlo.</td>
  </tr>
  <tr> 
    <td>Presentar en Preregistro</td>
    <td>Para formularios en caso de que el tr&aacute;mite requiera que se realice 
      de forma presencial la plataforma indicar&aacute; al usuario que debe imprimir 
      el formulario y llevarlo firmado.</td>
  </tr>
  <tr> 
    <td>Justificante en Preregistro</td>
    <td>Para formularios se puede indicar que uno de los formularios se utilice como justificante en preregistro.</td>
  </tr>
  <tr> 
    <td height="61">Presentar</td>
    <td><p>Para anexos se puede indicar que el usuario tenga que anexarlo telemáticamente o bien entregarlo de forma presencial.</p></td>
  </tr>
  <tr> 
    <td>Extensiones posibles</td>
    <td>Para anexos indica la lista de extensiones posibles del documento. Esta 
      lista estar&aacute; compuesta por sufijos de tres o cuatro letras separados por &quot;,&quot; 
      (Ej; txt,doc,zip)</td>
  </tr>
  <tr> 
    <td>Conversi&oacute;n a PDF</td>
    <td>
    <p>
    Si se habilita esta opci&oacute;n el fichero anexado se convertir&aacute; a PDF. Tras el proceso de anexado se mostrar&aacute; 
    un mensaje indicando que se ha realizado esta conversi&oacute;n y que se debe verificar el contenido del documento.
    </p>
    <p>No se convertir&aacute;n todas la extensiones, s&oacute;lo las siguientes: doc, docx y odt.
    <p>
    Esta opci&oacute;n es incompatible con indicar que se debe firmar el documento. Si se indica que se debe firmar el documento no se 
    realizar&aacute; la conversi&oacute;n.
    </p>
    </td>
    
  </tr>
  <tr> 
    <td>Tama&ntilde;o m&aacute;ximo</td>
    <td>Para anexos indica el tama&ntilde;o m&aacute;ximo que puede tener el documento 
      (en Kb)</td>
  </tr>
  <tr> 
    <td>Url Plantilla</td>
    <td>Para anexos se puede indicar que el documento deba rellenarse seg&uacute;n 
      una plantilla. En este caso se indicar&iacute;a la URL de la plantilla. 
      La plataforma mostrar&aacute; un enlace a esta URL. Se recomienda que la 
      plantilla sea un fichero zip para evitar que el navegador abra directamente 
      ficheros tales como documentos de word.</td>
  </tr>
  <tr> 
    <td>Instrucciones descargar plantilla</td>
    <td><p>En caso de haber rellenado el campo anterior se puede indicar al usuario 
        en el paso inicial &quot;Debe saber&quot; que debe descargarse la plantilla 
        antes de iniciar el tr&aacute;mite.</p></td>
  </tr>
  <tr> 
    <td height="64">Compulsar</td>
    <td><p>Para anexos se puede indicar que el usuario debe mostrar presencialmente 
        el original del documento para su compulsa. Si existe un documento con 
        estas caracter&iacute;sticas convertir&aacute; la tramitaci&oacute;n en 
        presencial.<em></em></p></td>
  </tr>
  <tr> 
    <td height="61">Presentar Fotocopia</td>
    <td><p>Para anexos se puede indicar que el usuario debe mostrar presencialmente una fotocopia. Si existe un documento con 
        estas caracter&iacute;sticas convertir&aacute; la tramitaci&oacute;n en 
        presencial.<em></em></p></td>
  </tr>
  <tr> 
    <td height="42">Gen&eacute;rico</td>
    <td><p>Para anexos permite que el usuario anexe m&aacute;s de una instancia 
        de un documento. Para cada instancia se permitir&aacute; que el usuario 
        introduzca una descripci&oacute;n personalizada para la instancia.<em> 
        <br>
        </em>Si es gen&eacute;rico no se puede indicar que sea fotocopia.</p></td>
  </tr>
  <tr> 
    <td height="23">Max. numero doc. genericos</td>
    <td>En el caso de gen&eacute;rico indica el m&aacute;ximo n&uacute;mero de 
      instancias. </td>
  </tr>
  <tr> 
    <td height="23">Nombre documento</td>
    <td>Nombre descriptivo del documento</td>
  </tr>
  <tr> 
    <td height="23">Informaci&oacute;n adicional</td>
    <td>Informaci&oacute;n espec&iacute;fica del documento.</td>
  </tr>
</table>
