<html>
<head>
</head>
<body>
<h1 class="gttH1">CONFIGURACI&Oacute;N DE PROCESAMIENTO</h1>
Esta ventana contiene las opciones de configuraci&oacute;n para el procesamiento de las solicitudes del procedimiento contra el Backoffice correspondiente.<br>

<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en la ventana son los siguientes:
<ul>
<li><span class="nombreCampo">Identificador:</span> C&oacute;digo que identifica un&iacute;vocamente el procedimento. Este campo es no editable.</li>
<li><span class="nombreCampo">Descripci&oacute;n:</span> Texto descriptivo del procedimento. Este campo es no editable.</li>
<li><span class="nombreCampo">Activar procesamiento:</span> Esta casilla permite habilitar el aviso de entradas al Backoffice. Si se marca esta casilla aparecer&aacute;n el resto de campos que se describen a continuaci&oacute;n.</li>
<li><span class="nombreCampo">Avisos:</span> Apartado que permite configurar las opciones de aviso a Backoffice.</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Intervalo de avisos (minutos):</span> Este campo permite indicar cada cuantos minutos se avisar&aacute; al Backoffice que tiene entradas pendients de procesar.</li>
<li><span class="codigoPurpura">Aviso inmediato:</span> Esta casilla permite habilitar/deshabilitar el aviso inmediato de las entradas al Backoffice una vez que lleguen a la Safata Telem&aacute;tica.</li>
</ul>
<li><span class="nombreCampo">Tipo aviso:</span> Este apartado permite configurar las opciones relatives a la tecnologia a utilizar para avisar al Backoffice de las entradas a procesar. A continuaci&oacute;n se exponen las diferentes opciones:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">EJB:</span> Indica que la comunicaci&oacute;n se llevar&aacute; a cabo utilizando EJBs. Si se selecciona esta opci&oacute;n se tendr&aacute;n  que cumplimentar las configuraciones siguientes:</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Localizaci&oacute;n: </span>Casilla de selecci&oacute;n &uacute;nica que permite establecer la localizaci&oacute;n del EJB que recibir&aacute; el aviso de nuevas entradas. Si este EJB se encuentra en el mismo servidor que la plataforma se tendr&aacute; que seleccionar Local, en caso contrario Remoto.</li>
<li><span class="codigoRojo">JNDI: </span>Campo en el que se ha de especificar el JNDI de acceso al EJB.</li>
<li><span class="codigoRojo">Url: </span>En caso que el EJB est&eacute; remoto a SISTRA, este campo ha de contener la URL de acceso al servidor en el que se encuentra el EJB.</li>
</ul>
<li><span class="codigoPurpura">Webservice:</span> Indica que la comunicaci&oacute;n se llevar&aacute; a cabo utilizando Webservices</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Url: </span>Este campo ha de contener la URL del endpoint del Webservice.</li>
<li><span class="codigoRojo">Versi&oacute;n: </span>En este campo se ha de seleccionar la versión del Webservice a utilizar para el aviso de las entradas.</li>
</ul>
</ul>
<li><span class="nombreCampo">Autenticaci&oacute;n expl&iacute;cita:</span> Casilla de selecci&oacute;n &uacute;nica que permite indicar el tipo de autenticaci&oacute; a utilizar en el aviso de las entradas. Si se selecciona No, no se utilizar&aacute; autenticaci&oacute;n, si se selecciona Usuario/Password se utilizar&aacute; el usuario y password indicados, y si se selecciona Autenticación organismo se utilizar&aacute; el usuario y password indicados para el procedimiento en el fichero de propiedades del plugin de login de SISTRA.</li>
</body>
</html>