<html>
<head>
</head>
<body>
<h1 class="gttH1">TR&Aacute;MITES DE ORGANISMO</h1>
En esta pesta&ntilde;a de la pantalla de organismo se presenta un listado con los tr&aacute;mites asociados al organismo.<br>
El listado est&aacute; paginado, y se puede ordenar por todas las columnas.
<h2 class="gttH2">OPERATIVA</h2>
Las acciones que se pueden realizar pueden variar en funci&oacute;n del rol y los permisos. Las acciones disponibles son las siguientes:
<ul>
<li><span class="operativa">Buscar:</span> Busca tr&aacute;mites pudiendo filtrar mediante un campo de filtrado. El campo de filtrado busca coincidencias en el identificador y en la descripci&oacute;n del tr&aacute;mite. No es sensible a las may&uacute;sculas y min&uacute;sculas.<br>
Para que se refresque el listado con las condiciones de filtrado se ha de pulsar el bot&oacute;n <span class="boton">Buscar</span>.<br>
<li><span class="operativa">Nuevo tr&aacute;mite:</span> Haciendo click en el bot&oacute;n <span class="boton">Nuevo</span> se abre la pantalla para dar de alta un nuevo tr&aacute;mite. </li> 
<li><span class="operativa">Edici&oacute;n de tr&aacute;mite:</span> Seleccionando un tr&aacute;mite del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span>, se carga la pantalla de informaci&oacute;n del tr&aacute;mite.</li>
<li><span class="operativa">Consulta de tr&aacute;mite:</span> Seleccionando un tr&aacute;mite del listado y haciendo click en el bot&oacute;n <span class="boton">Consultar</span>, se carga la pantalla de informaci&oacute;n del tr&aacute;mite en modo consulta.</li>
<li><span class="operativa">Eliminaci&oacute;n de tr&aacute;mite:</span> Seleccionando un tr&aacute;mite del listado y haciendo click en el bot&oacute;n <span class="boton">Eliminar</span>, se eliminar&aacute; en el caso de que no tenga versiones asociadas.</li>
<li><span class="operativa">Mover tr&aacute;mite:</span> Seleccionando un tr&aacute;mite del listado y haciendo click en el bot&oacute;n <span class="boton">Mover</span>, se cambiar&aacute; de organismo el tr&aacute;mite.</li>
</ul>
Haciendo click con el bot&oacute;n derecho del rat&oacute;n  aparece un men&uacute; contextual con las acciones disponibles.<br>
La opciones Edici&oacute;n y Consulta no estan disponibles a la vez.<br>
Haciendo doble click sobre cualquier registro se realiza la acci&oacute;n Edici&oacute;n o Consulta, seg&uacute;n el rol y los permisos.
<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en el listado son los siguientes:
<ul>
<li><span class="nombreCampo">C&oacute;digo:</span> Identificador del tr&aacute;mite.</li>
<li><span class="nombreCampo">Tr&aacute;mites:</span> Nombre del tr&aacute;mite. Se muestra en el idioma en que est&aacute; el Gestor.</li>
</ul>
</body>
</html>

