<html>
<head>
</head>
<body>
<h1 class="gttH1">DOMINIOS DE ORGANISMO</h1>
En esta pesta&ntilde;a de la pantalla de organismo se presenta un listado con los dominios asociados al organismo.<br>
En el listado se visualizan el c&oacute;digo y descripci&oacute;n de los dominios.<br> 
El listado est&aacute; paginado, y se puede ordenar por todas las columnas.
<h2 class="gttH2">OPERATIVA</h2>
Las acciones que se pueden realizar pueden variar en funci&oacute;n del rol y el entorno. Las acciones disponibles son las siguientes:
<ul> 
<li><span class="operativa">Buscar:</span> Busca dominios pudiendo filtrar mediante un campo de filtrado.<br>
El campo de filtrado busca coincidencias en el identificador y en la descripci&oacute;n del dominio. No es sensible a las may&uacute;sculas y min&uacute;sculas.<br>
Para que se refresque el listado con las condiciones de filtrado se ha de pulsar el bot&oacute;n <span class="boton">Buscar</span>.<br>
Opci&oacute;n disponible para cualquier rol o entorno.</li>
<li><span class="operativa">Nuevo dominio:</span> Haciendo click en el bot&oacute;n <span class="boton">Nuevo</span> se abre la pantalla para dar de alta un nuevo dominio. </li> 
<li><span class="operativa">Edici&oacute;n de dominio:</span> Seleccionando un dominio del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span>, se abre la pantalla de dominio con la informaci&oacute;n del dominio.</li>
<li><span class="operativa">Consulta de dominio:</span> Seleccionando un dominio del listado y haciendo click en el bot&oacute;n <span class="boton">Consultar</span>, se abre la pantalla de dominio con la informaci&oacute;n del dominio en modo consulta.</li>
<li><span class="operativa">Eliminaci&oacute;n de dominio:</span> Seleccionando un dominio del listado y haciendo click en el bot&oacute;n <span class="boton">Eliminar</span>, se eliminar&aacute; el dominio en el caso de que no est&eacute; asociado a ninguna versi&oacute;n.</li>
</ul>
Haciendo click con el bot&oacute;n derecho aparece un men&uacute; contextual con las acciones disponibles.<br>
La opciones Edici&oacute;n y Consulta no estan disponibles a la vez.<br>
Haciendo doble click sobre cualquier registro, se realiza la acci&oacute;n Edici&oacute;n o Consulta, seg&uacute;n el rol y entorno.
<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en el listado son los siguientes:
<ul>
<li><span class="nombreCampo">C&oacute;digo:</span> Identificador del dominio.</li>
<li><span class="nombreCampo">Descripci&oacute;n:</span> Descripci&oacute;n del dominio.</li>
</ul>
</body>
</html>
