<html>
<head>
</head>
<body>
<h1 class="gttH1">ALTA / EDICI&Oacute;N DE GESTOR</h1>
Esta ventana contiene las opciones de configuraci&oacute;n del nuevo gestor o del gestor seleccionado para edici&oacute;n.<br>

<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en la ventana son los siguientes:
<ul>
<li><span class="nombreCampo">Identificador:</span> C&oacute;digo de usuario del gestor. Este c&oacute;digo debe ser el mismo que el utilizado por el usuario para la autenticaci&oacute;n.</li>
<li><span class="nombreCampo">Email:</span> Correo electr&oacute;nico del gestor. Cualquier aviso email que tenga como destinatario el gestor se enviar&aacute; a esta direcci&oacute;n de correo electr&oacute;nico</li>
<li><span class="nombreCampo">Procedimientos gestionados:</span> Listado de procedimientos gestionados por el usuario. Pulsando el bot&oacute;n <span class="boton">A&ntilde;adir</span> se le mostrar&aacute; una nueva ventanta con el listado de procedimientos existentes, pudiendo a&ntilde;adir al listado los que considere oportunos. De la misma manera, podr&aacute; revocar los permisos del gestor sobre un procedimiento concreto seleccion&aacute;ndolo en el listado y pulsando el bot&oacute;n <span class="boton">Quitar</span></li>
<li><span class="nombreCampo">Opciones de aviso:</span> Este apartado permite configurar los avisos a recibir por parte del gestor. Estos avisos estar&aacute;n referidos a los procedimientos que gestiona el usuario. El detalle de los campos es el siguiente:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Avisar nuevas entradas:</span> Este check permite habilitar el envio de avisos peri&oacute;dicos al usuario sobre las nuevas entradas recibidas en los procedimientos gestionados. La periodicidad de recepci&oacute;n de los env&iacute;os es la misma para todos los gestores y se configura a nivel de propiedades de la aplicaci&oacute;n
<li><span class="codigoPurpura">Avisar estado notificaciones:</span> Este check habilita la posibilidad de que los gestores de un procedimiento reciban avisos sobre las notificaciones asociadas al mismo en el mismo mail de aviso de entradas</li>
<li><span class="codigoPurpura">Aviso de monitorizaci&oacute;n:</span> Este check habilita el env&iacute;o al gestor de un correo electr&oacute;nico de aviso que informa del estado de las solicitudes recibidas en los procedimientos de los que el usuario es gestor. La periocidad de env&iacute;o de estos avisos es la misma para todos los gestores y se configura a nivel de propiedades de la aplicaci&oacute;n</li>
</ul>
<li><span class="nombreCampo">Opciones aplicaci&oacute;n bandeja telem&aacute;tica:</span> Este apartado permite configurar opciones relativas a la Bandeja Telem&aacute;tica para el gestor. El detalle de los campos es el siguiente:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Permitir cambio de estado entradas</span> Este check permite habilitar al gestor, en la Bandeja Telem&aacute;tica, para que modifique individualmente el estado de las entradas asociadas a los procedimientos gestionados</li>
<li><span class="codigoPurpura">Permitir cambio masivo estado entradas</span> Este check permite habilitar al gestor, en la Bandeja Telem&aacute;tica, para que modifique de manera masiva el estado de las entradas asociadas a los procedimientos gestionados</li>
<li><span class="codigoPurpura">Permitir gesti&oacute;n manual expedientes</span> Este check permite habilitar el acceso del gestor al M&oacute;dulo Manual de Gesti&oacute;n de Expendientes de la Bandeja Telem&aacute;tica. Desde este m&oacute;dulo el gestor podr&aacute; crear expedientes, notificaciones y/o comunicaciones asociadas a sus procedimientos</li>
</ul>
</body>
</html>