<html>
<head>
</head>
<body>
<h1 class="gttH1">CONFIGURACI&Oacute;N DEL PROCEDIMIENTO</h1>
Esta ventana contiene las opciones de configuraci&oacute;n del nuevo procedimiento o del procedimiento seleccionado para edici&oacute;n.<br>

<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en la ventana son los siguientes:
<ul>
<li><span class="nombreCampo">Identificador:</span> C&oacute;digo que identifica un&iacute;vocamente al procedimiento. Este c&oacute;digo debe ser un alfanum&eacute;rico de 20 posiciones y es recomendable que sea un c&oacute;digo nemot&eacute;cnico</li>
<li><span class="nombreCampo">Descripci&oacute;n:</span> Texto descriptivo del procedimiento. Este texto debe estar formado por un m&aacute;ximo de 100 car&aacute;cteres alfanum&eacute;ricos que describan el procedimiento en cuesti&oacute;n</li>
<li><span class="nombreCampo">Organismo:</span> Este campo muestra el organismo en el que se enmarcar&aacute; el procedimiento. Si pulsa el bot&oacute;n <span class="boton">...</span> se le mostrar&aacute; una nueva ventanta con el listado de organismos existentes, y podr&aacute; asociar un organismo al procedimiento en cuesti&oacute;n.</li>
<li><span class="nombreCampo">Gesti&oacute;n expedientes:</span> Este apartado contiene las configuraciones del procedimiento relativas a la gesti&oacute;n de expedientes. El detalle de cada campo es el siguiente:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Unidad Administrativa:</span> Este campo permite establecer la Unidad Administrativa por defecto que se utilizar&aacute; en la creaci&oacute;n de notificaciones asociadas al procedimiento. Este valor ser&aacute; modificable por el gestor al dar de alta una nueva notificaci&oacute;n</li>
<li><span class="codigoPurpura">Aviso notificaciones a gestores:</span> Este check habilita la posibilidad de que los gestores de un procedimiento reciban avisos sobre las notificaciones asociadas al mismo</li>
<li><span class="codigoPurpura">Permitir SMS:</span> Este check habilita la posibilidad de enviar avisos SMS al ciudadano al dar de alta una notificaci&oacute;n o una comunicaci&oacute;n asociada al procedimiento</li>
</ul>
<li><span class="nombreCampo">Gestores:</span> Este campo contiene un listado de los gestores que tienen permisos sobre el procedimiento</li>
</body>
</html>
