<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMIENTO DE CUENTAS DE ENV&Iacute;O</h1>
En esta pesta&ntilde;a de la pantalla de Administraci&oacute;n se presenta un listado con las cuentas existentes para el env&iacute;o de avisos, tanto de correo electr&oacute;nico como de SMS.<br>
El listado est&aacute; paginado, y se puede ordenar por todas las columnas.
<h2 class="gttH2">OPERATIVA</h2>
Las acciones de esta pesta&ntilde;a se refieren a las tareas de mantenimiento de procedimientos del entorno. Las acciones disponibles son las siguientes:
<ul>
<li><span class="operativa">Buscar:</span> Busca cuentas de env&iacute;o pudiendo filtrar mediante un campo de filtrado. El campo de filtrado busca coincidencias tanto en el identificador como en el nombre de la cuenta. No es sensible a las may&uacute;sculas y min&uacute;sculas.<br>
Para que se refresque el listado con las condiciones de filtrado se ha de pulsar el bot&oacute;n <span class="boton">Buscar</span>.<br>
<li><span class="operativa">Nueva cuenta de env&iacute;o:</span> Haciendo click en el bot&oacute;n <span class="boton">Nuevo</span> se abre la pantalla para dar de alta una nueva cuenta de env&iacute;o.</li> 
<li><span class="operativa">Edici&oacute;n de cuenta de env&iacute;o:</span> Seleccionando una cuenta de env&iacute;o del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span>, se carga la pantalla que contiene la configuraci&oacute;n de la cuenta.</li>
<li><span class="operativa">Eliminaci&oacute;n de cuenta de env&iacute;o:</span> Seleccionando una cuenta de env&iacute;o del listado y haciendo click en el bot&oacute;n <span class="boton">Eliminar</span>, se eliminar&aacute;.</li>
</ul>
Haciendo click con el bot&oacute;n derecho del rat&oacute;n  aparece un men&uacute; contextual con las acciones disponibles.<br>
La opciones Edici&oacute;n y Consulta no estan disponibles a la vez.<br>
Haciendo doble click sobre cualquier registro se realiza la acci&oacute;n Edici&oacute;n o Consulta, seg&uacute;n el rol y los permisos.
<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en el listado son los siguientes:
<ul>
<li><span class="nombreCampo">Identificador:</span> C&oacute;digo que identifica un&iacute;vocamente la cuenta de env&iacute;o</li>
<li><span class="nombreCampo">Descripci&oacute;n:</span> Texto descriptivo de la cuenta de env&iacute;o.</li>
</ul>
</body>
</html>