<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMIENTO DE GESTORES DE FORMULARIOS</h1>
En esta pesta&ntilde;a de la pantalla de Administraci&oacute;n se presenta un listado con los gestores de formularios habilitados para su utilizaci&oacute;n en SISTRA.<br>
El listado est&aacute; paginado, y se puede ordenar por todas las columnas.
<h2 class="gttH2">OPERATIVA</h2>
Las acciones que se pueden realizar pueden variar en funci&oacute;n del rol y los permisos. Las acciones disponibles son las siguientes:
<ul>
<li><span class="operativa">Buscar:</span> B&uacute;squeda de gestores de formularios utilizando un campo de filtrado. El campo de filtrado busca coincidencias tanto en el identificador como en la descripci&oacute;n del gestor de formularios. No es sensible a las may&uacute;sculas y min&uacute;sculas.<br>
Para que se refresque el listado con las condiciones de filtrado se ha de pulsar el bot&oacute;n <span class="boton">Buscar</span>.<br>
<li><span class="operativa">Nuevo gestor de formularios:</span> Haciendo click en el bot&oacute;n <span class="boton">Nuevo</span> se abre la pantalla para dar de alta un nuevo gestor de formularios. </li> 
<li><span class="operativa">Edici&oacute;n gestor de formularios:</span> Seleccionando un gestor de formularios del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span>, se carga la pantalla de informaci&oacute;n del mismo.</li>
<li><span class="operativa">Eliminaci&oacute;n de gestor:</span> Seleccionando un gestor de formularios del listado y haciendo click en el bot&oacute;n <span class="boton">Eliminar</span>, se eliminar&aacute; de la lista.</li>
</ul>
Haciendo click con el bot&oacute;n derecho del rat&oacute;n  aparece un men&uacute; contextual con las acciones disponibles.<br>
Haciendo doble click sobre cualquier registro se realiza la acci&oacute;n Edici&oacute;n o Consulta, seg&uacute;n el rol y los permisos.<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en el listado son los siguientes:
<ul>
<li><span class="nombreCampo">Identificador:</span> C&oacute;digo que permite identificar al gestor de formulario en los diferentes puntos de SISTRA</li>
<li><span class="nombreCampo">Descripci&oacute;n:</span> Texto descriptivo del gestor de formularios</li>
</ul>
</body>
</html>