<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMIENTO DEL REPOSITORIO DE DOCUMENTOS SEGUROS (REDOSE)</h1>
En esta pesta&ntilde;a de la pantalla de Administraci&oacute;n se presentan diferentes configuraciones relativas al Repositorio de Documentos Seguros (REDOSE)<br>
<h2 class="gttH2">OPERATIVA</h2>
Las acciones que se pueden realizar pueden variar en funci&oacute;n del rol y los permisos. Las acciones disponibles son las siguientes:
<ul>
<li><span class="operativa">Alta de formateador:</span> Haciendo click en el bot&oacute;n <span class="boton">A&ntilde;adir</span> se abre la pantalla para dar de alta un nuevo formateador</li>
<li><span class="operativa">Eliminar formateador:</span> Seleccionando un formateador del listado y haciendo click en el bot&oacute;n <span class="boton">Quitar</span> se eliminar&aacute; de la lista.</li> 
<li><span class="operativa">Edici&oacute;n formateador:</span> Seleccionando un formateador del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span>, se carga la pantalla de informaci&oacute;n del mismo.</li>
<li><span class="operativa">Alta de ubicaci&oacute;n del Repositorio de Documentos Seguros:</span> Haciendo click en el bot&oacute;n <span class="boton">A&ntilde;adir</span> se abre la pantalla para dar de alta una nueva ubicaci&oacute;n para el Repositorio de Documentos Seguros</li>
<li><span class="operativa">Eliminar ubicaci&oacute;n del Repositorio de Documentos Seguros:</span> Seleccionando una ubicaci&oacute;n del listado y haciendo click en el bot&oacute;n <span class="boton">Quitar</span> se abre la pantalla para dar de alta una nueva ubicaci&oacute;n para el Repositorio de Documentos Seguros</li>
<li><span class="operativa">Edici&oacute;n de ubicaci&oacute;n de Repositorio de Documentos Seguros:</span> Seleccionando una ubicaci&oacute;n del listado y haciendo click en el bot&oacute;n <span class="boton">Editar</span> se abre la pantalla que contiene la configuraci&oacute;n de la ubicaci&oacute;n </li>
<li><span class="operativa">Migraci&oacute;n de documentes entre ubicaciones RDS:</span> Haciendo click en el bot&oacute;n <span class="boton">Migrar</span> se abre la pantalla que nos permite llevar a cabo el proceso de migraci&oacute;n de documentos entre dos ubicaciones RDS definidas </li>
</ul>
Haciendo click con el bot&oacute;n derecho del rat&oacute;n  aparece un men&uacute; contextual con las acciones disponibles.<br>
Haciendo doble click sobre cualquier registro se realiza la acci&oacute;n Edici&oacute;n o Consulta, seg&uacute;n el rol y los permisos.<h2 class="gttH2">DESCRIPCI&Oacute;N DE CAMPOS</h2>
Los campos que aparecen en el listado son los siguientes:
<ul>
<li><span class="nombreCampo">Formateadores:</span> Listado de formateadores de documentos dados de alta en SISTRA.</li>
<li><span class="nombreCampo">Ubicaciones:</span> Listado de ubicaciones del Repositorio de Documentos Seguros</li>
<li><span class="nombreCampo">Ver logs:</span> Apartado que contiene opciones de log relacionadas con el REDOSE. El detalle de las opciones es:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Log operaciones REDOSE:</span> Este opci&oacute;n permite consultar el hist&oacute;rico de operaciones realizadas sobre el Repositorio de Documentos Seguros. Para consultar este hist&oacute;rico se ha de pulsar el bot&oacute;n <span class="boton">...</span> situado a la derecha del texto</li>
<li><span class="codigoPurpura">Log errores consolidaci&oacute;n Gestor Documental:</span> Esta opci&oacute;n permite consultar el hist&oacute;rico de errores que se hayan podido producir en el proceso de consolidaci&oacute;n de documentos en el Gestor Documental corporativo del organismo. Esta opci&oacute;n &uacute;nicamente mostrar&aacute; datos en caso de que la instalaci&oacute;n SISTRA tenga habilitado el plugin de gestor documental. Para consultar este hist&oacute;rico se ha de pulsar el bot&oacute;n <span class="boton">...</span> situado a la derecha del texto</li>
</ul>
</ul>
</body>
</html>