<html>
<head>
</head>
<body>
<h1 class="gttH1">CONFIGURACI&Oacute; DEL PROCEDIMENT</h1>
Aquesta finestra cont&eacute; les opcions de configuraci&oacute; del nou procediment o del procediment seleccionat per la seva edici&oacute;.<br>

<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi que identifica un&iacute;vocament el procediment. Aques codi ha de ser un alfanum&egrave;ric de 20 posicions i &eacute;s recomanable que sigui un codi mnemot&egrave;cnic</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Text descriptiu del procediment. Aquest text deu estar format per un m&agrave;xim de 100 car&agrave;cters alfanum&egrave;rics que descriuen el procediment en q&uuml;esti&oacute;</li>
<li><span class="nombreCampo">Organisme:</span> Aquest camp mostra l'organisme al que s'enmarcar&agrave; el procediment. Si pitjau el bot&oacute; <span class="boton">...</span> se us mostrar&agrave; una nova finestra amb el llistat d'organismes existents, i podreu associar un organisme al procediment en q&uuml;esti&oacute;.</li>
<li><span class="nombreCampo">Gesti&oacute; expedients:</span> Aquest apartat cont&eacute; les configuracions del procediment relatives a la gesti&oacute; d'expedients. El detall de cada camp &eacute;s el seg&uuml;ent:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Unitat Administrativa:</span> Aquest camp permet establir l'Unitat Administrativa per defecte que s'emprar&agrave; en la creaci&oacute; de notificacions associades al procediment. Aquest valor ser&agrave; modificable pel gestor al donar d'alta una nova notificaci&oacute;</li>
<li><span class="codigoPurpura">Av&iacute;s notificacions a gestors:</span> Aquest check habilita la possibilitat de que els gestors d'un procediment rebin avisos relatius a les notificacions associades al mateix</li>
<li><span class="codigoPurpura">Permetre SMS:</span> Aquest check habilita la possibilitat d'enviar avisos SMS al ciutad&agrave; al donar d'alta una notificaci&oacute; o una comunicaci&oacute; associada al procediment</li>
</ul>
<li><span class="nombreCampo">Gestors:</span> Aquest camp cont&eacute; un llistat dels gestors que tenen permisos damunt el procediment</li>
</body>
</html>
