<html>
<head>
</head>
<body>
<h1 class="gttH1">ALTA / EDICI&Oacute; DE GESTOR</h1>
Aquesta finestra cont&eacute; les opcions de configuraci&oacute; del nou gestor o del gestor seleccionat per edici&oacute;.<br>

<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen a la finestra s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi d'usuari del gestor. Aquest codi ha de ser el mateix que l'emprat per l'usuari per l'autenticaci&oacute;.</li>
<li><span class="nombreCampo">Adre&ccedil;a electr&ograve;nica:</span> Adre&ccedil;a electr&ograve;nica del gestor. Qualsevol av&iacute;s email que tengui com a destinatari el gestor s'enviar&agrave; a aquesta direcci&oacute; de correu electr&ograve;nic</li>
<li><span class="nombreCampo">Procediments gestionats:</span> Llistat de procediments gestionats per l'usuari. Pitjant el bot&oacute; <span class="boton">Afegir</span> se us mostrar&agrave; una nova finestra amb el llistat de procediments existents, podent afegir al llistat els que considereu oportuns. De la mateixa manera, podreu revocar els permisos del gestor damunt un procediment concret seleccionant-lo al llistat i pitjant el bot&oacute; <span class="boton">Llevar</span></li>
<li><span class="nombreCampo">Opcions de av&iacute;s:</span> Aquest apartat permet configurar els avisos a rebre per part del gestor. Aquests avisos estaran referits als procediments que gestiona l'usuari. El detall dels camps &eacute;s el seg&uuml;ent:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Avisar noves entrades:</span> Aquest check permet habilitar l'enviament d'avisos peri&ograve;dics a l'usuari relatius a les noves entrades rebudes als procediments gestionats. La periodicitat de recepci&oacute; dels enviament es la mateixa per tots els gestors i es configura a nivell de propietats de l'aplicaci&oacute;
<li><span class="codigoPurpura">Avisar estat notificacions:</span> Aquest check habilita la possibilitat de que els gestors de un procediment rebin avisos relatius a les notificacions associades al mateix incorporats al mail d'av&iacute; d'entrades</li>
<li><span class="codigoPurpura">Aviso de monitoritzaci&oacute;:</span> Aquest check habilita l'enviament al gestor d'un correu electr&ograve;nic d'avi&acute;s que informa de l'estat de les sol·licituts rebudes als procediments gestionats per l'usuari. La periodicitat d'enviament d'aquests avisos &eacute;s la mateixa per tots els gestors i es configura a nivell de propietates de la aplicaci&oacute;</li>
</ul>
<li><span class="nombreCampo">Opcions aplicaci&oacute; Safata Telem&agrave;tica:</span> Aquest apartat permet configurar opcions relatives a la Safata Telem&agrave;tica pel gestor. El detall dels camps es el seg&uuml;ents:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Permet canvi d'estat d'entrades:</span> Aquest check permet habilitar al gestor, a la Safata Telem&agrave;tica, perquè modifiqui individualment l'estat de les entrades associades als procediments gestionats</li>
<li><span class="codigoPurpura">Permet canvi massiu estat entrades:</span> Aquest check permet habilitar al gestor, a la Safata Telem&agrave;tica, perquè modifiqui de manera massiva l'estat de les entrades associades als procediments gestionats</li>
<li><span class="codigoPurpura">Permet gesti&oacute; manual expedients:</span> Aquest check permet habilitar l'acc&eacute;s del gestor al M&ograve;dul Manual de Gesti&oacute; d'Expendients de la Safata Telem&arave;tica. Des d'aquest m&ograve;dul el gestor podr&agrave; crear expedients, notificacions i/o comunicacions associades als seus procediments</li>
</ul>
</body>
</html>