<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMENT DE COMPTES D'ENVIAMENT</h1>
En aquest pipella de la pantalla d'Administraci&oacute; es presenta un llistat amb els comptes existents per l'enviament d'avisos, tant de correu electr&ograve;nic com de SMS.<br>
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions d'aquesta pipella es refereixen a les tasques de manteniment de procediments de l'entorn. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><span class="operativa">Cercar:</span> Cerca comptes d'enviament poguent filtrar mitjan&ccedil;ant un camp de filtrat. El camp de filtrat cerca coincid&egrave;ncies tant a l'identificador com al nom del compte. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br>
Perquè es refresqui el llistat amb les condicions de filtrat s'ha de pitjar el bot&oacute; <span class="boton">Cercar</span>.<br>
<li><span class="operativa">Nou compte d'enviament:</span> Pitjant el bot&oacute; <span class="boton">Nou</span> s'obri la pantalla per donar d'alta un nou compte d'enviament.</li> 
<li><span class="operativa">Edici&oacute; de compte d'enviament:</span> Seleccionant un compte d'enviament del llistat i pitjant el bot&oacute; <span class="boton">Editar</span>, es carrega la pantalla que cont&eacute; la configuraci&oacute; del compte.</li>
<li><span class="operativa">Eliminaci&oacute; de compte d'enviament:</span> Seleccionant un compte d'enviament del llistat i pitjant el bot&oacute; <span class="boton">Eliminar</span>, s'eliminar&agrave;.</li>
</ul>
Pitjant el bot&oacute; dret del ratol&iacute; apareix un men&uacute; contextual amb les accions disponibles.<br>
Les opcions Edici&oacute; i Consulta no estan disponibles a la vegada.<br>
Fent doble click damunt qualsevol dels registres es reatliza l'acci&oacute; Edici&oacute; o Consulta, segons el rol i els permisos.
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi que identifica un&iacute;vocament el compte d'enviament</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Text descriptiu del compte d'enviament.</li>
</ul>
</body>
</html>