<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMENT DE GESTORS DE PROCEDIMENT</h1>
En aquesta pipella de la pantalla d'Administraci&oacute; es presenta un llistat amb els gestors de procediments donades d'alta pel seu manteniment.<br>
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions que se poden reatlizar poden variar en funci&oacute; del rol i els permisos. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><span class="operativa">Cercar:</span> Cerca de gestors emprant un camp de filtrat. El camp de filtrat cerca coincid&egrave;ncies tant a l'identificador com a la descripci&oacute; del gestor. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br>
Perqu&egrave; es refresqui el llistat amb les condicions de filtrat s'ha de pitjar el bot&oacute; <span class="boton">Cercar</span>.<br>
<li><span class="operativa">Nou gestor:</span> Pitjant el bot&oacute; <span class="boton">Nou</span> s'obri la pantalla per donar d'alta un nou gestor. </li> 
<li><span class="operativa">Edici&oacute; gestor:</span> Seleccionant un organisme del llistat i pitjant el bot&oacute;n <span class="boton">Editar</span>, es carrega la pantalla d'informaci&oacute; del gestor.</li>
<li><span class="operativa">Eliminaci&oacute; de gestor:</span> Seleccionant un gestor del llistat i pitjant el bot&oacute; <span class="boton">Eliminar</span>, s'eliminar&agrave; de la llista.</li>
</ul>
Pitjant el bot&oacute; dret del ratol&iacute; apareix un men&uacute; contextual amb les accions disponibles.<br>
Fent doble click damunt qualsevol dels registres es reatliza l'acci&oacute; Edici&oacute; o Consulta, segons el rol i els permisos.<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi d'usuari del gestor</li>
<li><span class="nombreCampo">Adre&ccedil;a electr&ograve;nica:</span> Adre&ccedil;a electr&ograve;nica associada al gestor</li>
</ul>
</body>
</html>