<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMENT DEL REPOSITORI DE DOCUMENTS SEGURS (REDOSE)</h1>
En aquesta pipella de la pantalla d'Administraci&oacute; es presenten diferents configuracions relatives al Repositori de Documents Segurs (REDOSE)<br>
<h2 class="gttH2">OPERATIVA</h2>
Les accions que es poden realitzar poden variar en funci&oacute; del rol i els permisos. Les accions disponibles s&oacute;n las seg&uuml;ents:
<ul>
<li><span class="operativa">Alta de formatador:</span> Pitjant al bot&oacute; <span class="boton">Afegir</span> s'obri la pantalla per donar d'alta un nou formatador</li>
<li><span class="operativa">Eliminar formatador:</span> Seleccionant un formatador del llistat i pitjant el bot&oacute;n <span class="boton">Llevar</span> s'eliminar&agrave; de la llista.</li> 
<li><span class="operativa">Edici&oacute; formatador:</span> Seleccionant un formatador del llistat i pitjant el bot&oacute;n <span class="boton">Editar</span>, es carrega la pantalla d'informaci&oacute; del mateix.</li>
<li><span class="operativa">Alta d'ubicaci&oacute; del Repositori de Documents Segurs:</span> Pitjant el bot&oacute; <span class="boton">Afegir</span> s'obri la pantalla per donar d'alta una nova ubicaci&oacute; pel Repositori de Documents Segurs</li>
<li><span class="operativa">Eliminar ubicaci&oacute; del Repositori de Documents Segurs:</span> Seleccionant una ubicaci&oacute; del llistat i pitjant el bot&oacute; <span class="boton">Llevar</span> s'obri la pantalla per donar d'alta una nova ubicaci&oacute; pel Repositori de Documents Segurs</li>
<li><span class="operativa">Edici&oacute; d'ubicaci&oacute; de Repositori de Documents Segurs:</span> Seleccionant una ubicaci&oacute; del llistat i pitjant el bot&oacute; <span class="boton">Editar</span> s'obri la pantalla que cont&eacute; la configuraci&oacute; de la ubicaci&oacute; </li>
<li><span class="operativa">Migraci&oacute; de documents entre ubicacions RDS:</span> Pitjant el bot&oacute; <span class="boton">Migrar</span> s'obri la pantalla que ens permit dur a terme el proc&eacute;s de migraci&oacute; de documents entre dos ubicacions RDS definides </li>
</ul>
Pitjant el bot&oacute; dret del ratol&iacute; apareix un men&uacute; contextual amb les accions disponibles.<br>
Fent doble clic damunt qualsevol dels registres es realitza l'acci&oacute; Edici&oacute; o Consulta, segons el rol i els permisos.<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Formatadors:</span> Llistat de formatadors de documents donats d'alta a SISTRA.</li>
<li><span class="nombreCampo">Ubicacions:</span> Llistat d'ubicacions del Repositori de Documents Segurs</li>
<li><span class="nombreCampo">Veure logs:</span> Apartat que cont&eacute; opcions de log relacionats amb el REDOSE. El detall de les opcions &eacute;s:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">Log operacions REDOSE:</span> Aquesta opci&oacute; permet consultar el hist&ograve;ric d'operacions realitzades damunt el Repositori de Documents Segurs. Per consultar aquest hist&ograve;ric s'ha de pitjar el bot&oacute; <span class="boton">...</span> situat a la dreta del text</li>
<li><span class="codigoPurpura">Log errors consolidaci&oacute; Gestor Documental:</span> Aquesta opci&oacute; permet consultar el hist&ograve;ric d'errors que s'hagin pogut produir al proc&eacute;s de consolidaci&oacute; de documents al Gestor Documental corporatiu de l'organisme. Aquesta opci&oacute; &uacute;nicament mostrar&agrave; dades en cas que la instal·laci&oacute; SISTRA tingui habilitat el plugin de gestor documental. Per consultar aquest hist&ograve;ric s'ha de pitjar el bot&oacute; <span class="boton">...</span> situat a la dreta del text</li>
</ul>
</ul>
</body>
</html>