<html>
<head>
</head>
<body>
<h1 class="gttH1">MANTENIMENT DE PROCEDIMENTS</h1>
En aquesta pipella de la pantalla d'Administraci&oacute; es presenta un llistat amb els procedimients existents.<br>
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions d'aquesta pipella es refereixen a les tasques de manteniment de procediments de l'entorn. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><span class="operativa">Cercar:</span> Cerca procediments podent filtrar mitjan&ccedil;ant un camp de filtrat. El camp de filtrat cerca coincid&egrave;ncies tant a l'identificador com a la descripci&oacute; del procediment. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br>
Perqu&egrave; es refresqui el llistat amb les condicions de filtrat s'ha de pitjar el bot&oacute; <span class="boton">Cercar</span>.<br>
<li><span class="operativa">Nou procediment:</span> Pitjant el bot&oacute; <span class="boton">Nou</span> s'obri la pantalla per donar d'alta un nou procediment.</li> 
<li><span class="operativa">Edici&oacute; de procediment:</span> Seleccionant un procediment del llistat i pitjant al bot&oacute; <span class="boton">Editar</span>, es carrega la pantalla d'informaci&oacute; del procediment.</li>
<li><span class="operativa">Eliminaci&oacute; de procediment:</span> Seleccionant un procediment del llistat i fent click al bot&oacute; <span class="boton">Eliminar</span>, s'eliminar&agrave; en cas que no tingui versions associades.</li>
</ul>
Pitjant el bot&oacute; dret del ratol&iacute;  apareix un men&uacute; contextual amb les accions disponibles.<br>
Les opcions Edici&oacute; i Consulta no estan disponibles a la vegada.<br>
Pitjant damunt qualsevol registre es realitza l'acci&oacute; Edici&oacute; o Consulta, segons el rol i els permisos.
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat són els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi que identifica un&iacute;vocament el procediment.</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Text descriptiu del procediment.</li>
</ul>
</body>
</html>
