<html>
<head>
</head>
<body>
<h1 class="gttH1">DOMINIS DE ORGANISME</h1>
En aquesta pestanya de la pantalla d&#39;organisme es presenta un llistat amb els dominis associats a l&#39;organisme.<br> 
En el llistat es visualitzen el codi i descripci&oacute; dels dominis.<br> 
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions que es poden realitzar poden variar en funci&oacute; del rol i l&#39;entorn. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><span class="operativa">Cercar:</span> Cerca dominis podent filtrar mitjan&ccedil;ant un camp de filtrat.<br> 
El camp de filtrat cerca coincid&egrave;ncies en l&#39;identificador i en la descripci&oacute; del domini. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br>  
Perqu&egrave; es refresque el llistat amb les condicions de filtrat s&#39;ha de pr&eacute;mer el bot&oacute; <span class="boton">Cercar</span>.<br>
Opci&oacute; disponible per a qualsevol rol o entorn.</li>
<li><span class="operativa">Nou domini:</span> Fent clic sobre el bot&oacute; <span class="boton">Nou</span> s&#39;obri la pantalla per a donar d&#39;alta un nou domini.</li> 
<li><span class="operativa">Edici&oacute; de domini:</span> Seleccionant un domini del llistat i fent clic sobre el bot&oacute; <span class="boton">Editar</span>, s&#39;obri la pantalla de domini amb la informaci&oacute; del domini seleccionat.</li>
<li><span class="operativa">Consulta de domini:</span> Seleccionant un domini del llistat i fent clic sobre el bot&oacute; <span class="boton">Consultar</span>, s&#39;obri la pantalla de domini amb la informaci&oacute; del domini seleccionat en mode consulta.</li> 
<li><span class="operativa">Eliminaci&oacute; de domini:</span> Seleccionant un domini del llistat i fent clic sobre el bot&oacute; <span class="boton">Eliminar</span>.</li>  
<li><span class="operativa">Llistat de tr&agrave;mits associats a un dominio:</span> Seleccionant un domini del llistat i fent clic sobre el bot&oacute; <span class="boton">Tr&agrave;mits</span>. Opci&oacute; disponible per a qualsevol rol o entorn.</li>
</ul>
Fent clic amb el bot&oacute; dret apareix un men&uacute; contextual amb les accions disponibles.<br> 
Fent doble clic sobre qualsevol registre es realitza l&#39;acci&oacute; Edici&oacute; o Consulta, segons el rol i entorn.
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS DE FORMULARI</h2>
Els camps que apareixen en el llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Codi:</span> Identificador del domini.</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Descripci&aacute; del domini.</li>
</ul>
</body>
</html>
