<html>
<head>
</head>
<body>
<h1 class="gttH1">TR&Agrave;MITS DE ORGANISME</h1>
En aquesta pestanya de la pantalla d&#39;organisme es presenta un llistat amb els tr&agrave;mits associats a l&#39;organisme.<br> 
En el llistat es visualitzen el codi del tr&agrave;mit, descripci&oacute; i versions actives.<br>
Per defecte nom&eacute;s apareixen els tr&agrave;mits que tenen almenys una versi&oacute; activa.<br> 
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions que es poden realitzar poden variar en funci&oacute; del rol i l&#39;entorn. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><span class="operativa">Cercar:</span> Cerca tr&agrave;mits podent filtrar mitjan&ccedil;ant un camp de filtrat i un check.<br> 
El camp de filtrat cerca coincid&egrave;ncies en l&#39;identificador i en la descripci&oacute; del tr&agrave;mit. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br> 
El check d&#39;inactiu, que per defecte est&agrave; desmarcat, si es marca condicionar&agrave; la recerca de tr&agrave;mits, independentment de l&#39;estat que es troben les seues versions (actives o inactives).<br> 
Perqu&egrave; es refresque el llistat amb les condicions de filtrat s&#39;ha de pr&eacute;mer el bot&oacute; <span class="boton">Cercar</span>.<br>
Opci&oacute; disponible per a qualsevol rol o entorn.</li>
<li><span class="operativa">Nou tr&agrave;mit:</span> Fent clic sobre el bot&oacute; <span class="boton">Nou</span> s&#39;obri la pantalla per a donar d&#39;alta un nou tr&agrave;mit.</li> 
<li><span class="operativa">Edici&oacute; de tr&agrave;mit:</span> Seleccionant un tr&agrave;mit del llistat i fent clic sobre el bot&oacute; <span class="boton">Editar</span>, es carrega la pantalla d&#39;informaci&oacute; del tr&agrave;mit.</li>
<li><span class="operativa">Consulta de tr&agrave;mit:</span> Seleccionant un tr&agrave;mit del llistat i fent clic sobre el bot&oacute; <span class="boton">Consultar</span>, es carrega la pantalla d&#39;informaci&oacute; del tr&agrave;mit en mode consulta.</li> 
<li><span class="operativa">Eliminaci&oacute; de tr&agrave;mit:</span> Seleccionant un tr&agrave;mit del llistat i fent clic sobre el bot&oacute; <span class="boton">Eliminar</span>.</li>  
</ul>
Fent clic amb el bot&oacute; dret apareix un men&uacute; contextual amb les accions disponibles.<br> 
Fent doble clic sobre qualsevol registre es realitza l&#39;acci&oacute; Edici&oacute; o Consulta, segons el rol i entorn. 
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS DE FORMULARI</h2>
Els camps que apareixen en el llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Codi:</span> Identificador del tr&agrave;mit.</li>
<li><span class="nombreCampo">Tr&agrave;mits:</span> Nom del tr&agrave;mit. Es mostra en l&#39;idioma que est&agrave; el Gestor.</li>
<li><span class="nombreCampo">Versions Actives:</span> Indica si la versi&oacute; del tr&agrave;mit es troba activa en este moment.</li>
</ul>
</body>
</html>
