 <table width="100%" border="1">
  <tr> 
    <td width="23%"><div align="center"><strong>Campo</strong></div></td>
    <td width="77%"><div align="center"><strong>Descripci&oacute;n</strong></div></td>
  </tr>
  <tr> 
    <td>Nivel autenticaci&oacute;n</td>
    <td>Indica los niveles a los que se aplicacar&aacute; estas especificaciones.<br>
      Un documento se le requerir&aacute; al usuario seg&uacute;n el nivel de 
      autenticaci&oacute;n con el que el usuario inicie sesi&oacute;n y los niveles 
      que se hayan especificado para el documento.</td>
  </tr>
  <tr> 
    <td>Versi&oacute;n</td>
    <td>Indica la versi&oacute;n del documento. Todo documento debe estar definido 
      en el RDS mediante un modelo / versi&oacute;n.</td>
  </tr>
  <tr> 
    <td>Obligatorio</td>
    <td>Indica si el documento ser&aacute; obligatorio, opcional o depender&aacute; 
      de datos introducidos en formularios.</td>
  </tr>
  <tr> 
    <td>Script Obligatoriedad</td>
    <td>Si el documento es dependiente su dependencia se deber&aacute; indicar 
      mediante este script. El tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
      y espera como resultado: S, N o D.</td>
  </tr>
  <tr> 
    <td>Script flujo tramitaci&oacute;n</td>
    <td>Indica usuario que debe aportar este documento (solo para autenticado 
      y si esta habilitado el flujo de tramitaci&oacute;n). Si es nulo o devuelve 
      vac&iacute;o debe aportarlo qui&eacute;n inicia el tr&aacute;mite.</td>
  </tr>
  <tr> 
    <td height="42">Firmar digitalmente</td>
    <td>Indica si el documento debe ser firmado por el usuario despu&eacute;s 
      de rellenarlo (formularios) o anexarlo (anexo). El firmante deber&aacute; 
      disponer de certificado digital.</td>
  </tr>
  <tr> 
    <td>Campo DNI Firmante</td>
    <td>Indica quien debe firmar el documento. Este campo es de tipo <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> y debe
    devolver un nif. En caso de dejar vacio este script el firmante ser&aacute; el iniciador del tr&aacute;mite. 
    <br/>
    Para tr&aacute;mites que se tramiten de forma delegada en caso de que el nif no sea del usuario que esta rellenado el tr&aacute;mite
    se remitir&aacute; el documento a la bandeja de firma de la zona de entidad, siendo requisito que el nif del firmante este registrado como delegado de 
    la entidad. Adem&aacute;s en caso de tramitaci&oacute;n en forma delegada se permitir&aacute;
    indicar varios nifs separados por #. 
    <br/>
    
    </td>
  </tr>
  <tr> 
    <td>Content type signatura </td>
    <td>Indica el content type del document a signar. Si no s'especifica s'utilitzar&agrave; 
      un per defecte.</td>
  </tr>
  <tr> 
    <td>Gestor de formularios</td>
    <td><p>Indica el gestor de formularios que se invocará (FORMS,etc)</p></td>
  </tr>
  <tr> 
    <td>Modelo - Versión</td>
    <td><p>Identifica en el gestor de formularios el modelo/versión del formulario. Para FORMS hay un botón de selección.</p></td>
  </tr>
  <tr> 
    <td>Script carga de datos iniciales</td>
    <td><p>Para formularios permite precargar datos en el formulario (p.ej. nif 
        y nombre del usuario). El tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
        y no espera ning&uacute;n resultado.</p>
      <p>La forma de precargar estos datos desde el script es mediante el plugin 
        DATOSINICIALES:<em> <br>
      DATOSINICIALES.setDatoInicial('campo1','valor1');</em></p>
      <p><em>NOTA: Actualmente no se pueden alimentar campos indexados (listas, etc.)</em> <br>
      </p></td>
  </tr>
  <tr> 
    <td height="137">Script configuraci&oacute;n de formularios</td>
    <td><p>Para formularios permite: <br>
    	<ul>
    		<li>- bloquear campos en un formulario FORMS (p.ej. si precargamos nif del certificado no permitimos editarlo).</li>
        	<li>- establecer propiedades específicas para el gestor de formularios. Para FORMS disponemos de las siguientes propiedades: 
	        	<br> * pantallaFin.mostrar: (true/false) indica si se muestra la última pantalla de FORMS (por defecto true)
	        	<br> * pantallaFin.titulo: permite establecer el título de la última pantalla de FORMS
	        	<br> * pantallaFin.texto: permite establecer el texto de la última pantalla de FORMS
        	</li>
       </ul> 
       <p>
        El tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
        y no espera ning&uacute;n resultado.</p>
      <p>La forma de precargar esta configuraci&oacute;n es mediante el plugin CONFIGURACIONFORMULARIO:
      	<em> <br>
        CONFIGURACIONFORMULARIO.setDatoSoloLectura('campo1');<br>
        CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.mostrar","true");
		CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.titulo",PLUGIN_MENSAJES.getMensaje("tituloFORMS"));
		CONFIGURACIONFORMULARIO.setPropiedad("pantallaFin.texto",PLUGIN_MENSAJES.getMensaje("textoFORMS"));        
        </em></p></td>
  </tr>
  <tr> 
    <td height="70">Script de validaci&oacute;n de retorno de FORMS</td>
    <td>Para formularios permite realizar una validaci&oacute;n sobre los datos 
      del formulario devuelto por FORMS. El tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
      y espera como resultado S en caso correcto y N en caso de error.</td>
  </tr>
  <tr>
    <td height="60">Script de modificaci&oacute;n retorno de FORMS</td>
    <td>Para formularios permite modificar datos de otros formularios tras volver 
      de FORMS. Para ello se permite en el plugin de formularios acceder a un m&eacute;todo para establecer datos en otros formularios:
      <em> <br>
       PLUGIN_FORMULARIOS.setDatoFormulario('FOR1',1,'campo1','valorCampo');        
        </em>
      </td>
  </tr>
  <tr> 
    <td height="60">Script Plantilla</td>
    <td>Para formularios permite establecer la plantilla que debe utilizarse para 
      su visualizaci&oacute;n. El tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
      y espera como resultado el c&oacute;digo de la plantilla. Si el script retorna 
      cadena vacía ('') no se utilizara un plantilla especifica y se utilizar&aacute; 
      la por defecto.</td>
  </tr>
  <tr> 
    <td height="631">Script para calculo datos pago</td>
    <td><p>Para pagos permite realizar el c&aacute;lculo de la tasa a pagar. El 
        tipo de este campo es <a class="enlaceAyuda" href="/sistraback/ayuda_es/ayudaScript.jsp">script</a> 
        y no espera ning&uacute;n resultado.</p>
      <p>La forma de indicar los datos del pago es mediante el plugin <em>DATOSPAGO</em>.</p>
      <p>Los datos obligatorios a establecer son:<br>
      	<ul>
    		<li>Modelo: modelo de tasa (por defecto 046)</li>
    		<li>Id Tasa: identificador de la tasa</li>
    		<li>Concepto: concepto de la tasa (por defecto el t&iacute;tulo del pago)</li>
    		<li>Fecha devengo: fecha de c&aacute;lculo de la tasa en formato YYYYMMMDD (por defecto la fecha actual)</li>
    		<li>Importe: importe de la tasa en formato cents (1 euro = 100 cents)</li>
    		<li>Nif: nif del declarante (por defecto el nif del representante)</li>
    		<li>Nombre: nombre y apellidos del declarante (por defecto el nombre y apellidos del representante)</li>
    	</ul>
    	<br/>
    	Los m&eacute;todos son los siguientes:<br/>    		
      	DATOSPAGO.setModelo('Modelo');<br>
        DATOSPAGO.setIdTasa('IdTasa');<br>
        DATOSPAGO.setConcepto('Concepto del pago');<br>
        DATOSPAGO.setFechaDevengo('Fecha');<br>
        DATOSPAGO.setImporte('Importe');<br>        
        DATOSPAGO.setNif('Nif');<br>
        DATOSPAGO.setNombre('Nombre');<br>
	  </p>
	   <p> Adicionalmente se puede especificar una fecha l&iacute;mite para iniciar el pago: <br/>
	   		DATOSPAGO.setFechaLimitePago('dd/MM/yyyy HH:mm:ss');<br>
        	DATOSPAGO.setMensajeFechaLimitePago('Mensaje a mostrar si se excede la fecha limite');
	   </p> 
      <p> Adem&aacute;s se dispone de una funci&oacute;n para consultar el importe 
        de una tasa (en cents):<br/><br/>
        res = DATOSPAGO.consultarImporteTasa('idTasa')<em>;</em> // En caso de 
        error devuelve -1
        <br/><br/>
        En caso de que se necesiten pasar par&aacute;metros a la funci&oacute;n de consultar
        el importe se puede utilizar la funci&oacute;n: <br/><br/>
        DATOSPAGO.establecerParametroCalculoTasa('nombreParametro','valorParametro');<br/><br/>
        De esta forma se pueden pasar los par&aacute;metros necesarios para realizar el
        c&aacute;lculo. El uso de par&aacute;metros en el c&aacute;lculo de la tasa depender&aacute; del
        plugin de pago del organismo.                
        </p>
      <p> Ejemplo completo:<br/>
        <em>res = DATOSPAGO.consultarImporteTasa('1.2.6'); <br>
        if (res == -1) {<br>
        ERRORSCRIPT.setExisteError(true);<br>
        }else{<br>
        DATOSPAGO.setIdTasa('1.2.6');<br>
        DATOSPAGO.setImporte(res);<br>
        }<br>
        <br>
        </em></p></td>
  </tr>
  <tr> 
    <td height="56">Tipo de pago</td>
    <td>Indica el tipo de pago permitido: Telem&aacute;tico / Presencial / Ambos</td>
  </tr>
  <tr> 
    <td height="56">Informaci&oacute;n adicional</td>
    <td>Permite sobreescribir por nivel de autenticaci&oacute;n la informaci&oacute;n 
      espec&iacute;fica del documento.</td>
  </tr>
</table>
