<html>
<head>
</head>
<body>
<h1 class="gttH1">CONFIGURACI&Oacute; DE DOMINI</h1>
Aquesta finestra cont&eacute; les opcions de configuraci&oacute; del nou domini o del domini seleccionat per la seva edici&oacute;.<br>

<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen a la finestra s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Identificador:</span> Codi que identifica un&iacute;vocament el domini. Aquest codi ha de ser un alfanum&egrave;ric de 10 posicions i &eacute;s recomendable que sigui un codi mnemot&egrave;cnic</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Text descriptiu del domini. Aquest text ha d'estar format per un m&agrave;xim de 100 car&agrave;cters alfanum&eacute;rics que descriguin el domini en q&uuml;esti&oacute;</li>
<li><span class="nombreCampo">Configuraci&oacute; de cacheo:</span> </li>
<li><span class="nombreCampo">Tipus:</span> Aquest apartat permet establir el tipus del domini i les configuracions associades. El detall de cada camp &eacute;s el seg&uuml;ent:</li>
<ul class="codigoPurpura">
<li><span class="codigoPurpura">SQL:</span> Aquesta casella indica que el domini &eacute;s de tipus SQL. Aquest tipus de domini consisteix en la execuci&oacute; d'una consulta SQL damunt un datasource especificat. Si marqueu aquesta casella, haureu d'emplenar les dades seg&uuml;ents:</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Datasource: </span>Ruta JNDI del Datasource de connexi&oacute; amb la BBDD en la que s'executar&agrave; la consulta</li>
<li><span class="codigoRojo">Query: </span>Sent&egrave;ncia SQL que resol el domini. Els par&agrave;metres del domini s'hauran d'especificar amb un interrogant ("?")</li>
</ul>
<li><span class="codigoPurpura">EJB:</span> Aquesta casella indica que el domini &eacute;s de tipus EJB. Aquest tipus de domini accedir&agrave; a una aplicaci&oacute; que compleixi amb l'API d'integraci&oacute;</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Localitzaci&oacute;:</span> Indica la localitzaci&oacute; de l'EJB respecte al servidor al que est&agrave; desplegada la plataforma de tramitaci&oacute;. La localitzaci&oacute; pot ser local, si es troba al mateix servidor, o remot si es troba a un servidor diferent.</li>
<li><span class="codigoRojo">JNDI: </span>Indica el JNDI d'acc&eacute;s a l'EJB</li>
<li><span class="codigoRojo">Url: </span>En cas de localitzaci&oacute; remota, indica la url del servidor en el que est&agrave; ubicat l'EJB. Aquest camp no &eacute;s necessari en cas de localitzaci&oacute; local</li>
</ul>
<li><span class="codigoPurpura">Webservice:</span> Aquesta casella indica que el domini &eacute;s de tipus WS. Aquest tipus de domini accedir&agrave; a una aplicaci&oacute; que compleixi amb l'API d'integraci&oacute;</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Url: </span>Url del Webservice.</li>
<li><span class="codigoRojo">Versi&oacute;: </span>Indica la versi&oacute; del Webservice a emprar. Les versions dels WS i les seves funcionalitats estan especificades a la documentaci&oacute; d'integraci&oacute; de la Forja</li>
<li><span class="codigoRojo">Soap Action: </span>Permet indicar un Soap Action espec&iacute;fic a emprar en la cridada al dominio</li>
</ul>
<li><span class="codigoPurpura">Font de dades:</span> Aquesta casella indica que el domini &eacute;s de tipus font de dades. Aquest tipus de dominis accedeixen a un conjunt de dades mantingudes pel gestor a trav&eacute;s de l'opci&oacute; font de dades de Bantelfront</li>
<ul class="codigoRojo">
<li><span class="codigoRojo">Pseudo-Query: </span>En aquest camp s'indica la sent&egrave;ncia pseudoSQL per la consulta de la font de dades. El format de la consulta ha de complir el seg&uuml;ent:</li>
<p><i>SELECT camp (,camp)<br>FROM fontDades<br>WHERE expressi&oacute; ( [AND | OR] expressi&oacute; ] )*<br>ORDER BY camp</i></p>
<p>on expressi&oacute;: <i>camp [= | LIKE] ?</i>, sent "?" un par&agrave;metre.</p>
<p>Las part&iacute;cules de la sent&egrave;ncia pseudoSQL(SELECT, FROM, WHERE, AND, OR, LIKE, ORDER BY) ha d'estar en maj&uacute;scules.<br>Respecte a les comparacions al WHERE seran ignorecase (= y LIKE).<br>Respecte al LIKE es realitzar&agrave; autom&agrave;ticament la comparaci&oacute;: %par&agrave;metre%.<br>Respecte al ORDER BY nom&eacute; es pot indicar un camp. A m&eacute;s com tots els camps s&oacute;n de tipus cadena, l'ordenaci&oacute; &eacute;s literal pel que si es vol crear un camp a la font de dades que permeti ordenar seq&uuml;encialment, &eacute;s convenient emprar lletres en lloc de n&uacute;meros.</p>
</ul>
</ul>
<li><span class="nombreCampo">Provar domini:</span> Si pitjau al bot&oacute; associat a aquest camp, se us obrir&agrave; una finestra en la que podreu realitzar una prova d'invocaci&oacute; del domini, indicant pr&egrave;viament el valor dels par&agrave;metres corresponents. </li>
</body>
</html>