<html>
<head>
</head>
<body>
<h1 class="gttH1">DOMINIS D'ORGANISME</h1>
En aquesta pipella de la pantalla d'organisme es presenta un llistat amb els dominis associats a l'organisme.<br>
Al llistat es visualitcen el codi i descripci&oacute; dels dominis.<br> 
El llistat est&agrave; paginat, i es pot ordenar per totes les columnes.
<h2 class="gttH2">OPERATIVA</h2>
Les accions que es poden realitzar poden variar en funci&oacute; del rol i l'entorn. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul> 
<li><span class="operativa">Cercar:</span> Cerca dominis podent filtrar mitjan&ccedil;ant un camp de filtrat.<br>
El camp de filtrat cerca coincid&egrave;ncies a l'identificador i a la descripci&oacute; del domini. No &eacute;s sensible a les maj&uacute;scules i min&uacute;scules.<br>
Perqu&egrave; es refresqui el llistat amb les condicions de filtrat s'ha de pitjar el bot&oacute; <span class="boton">Cercar</span>.<br>
Opci&oacute; disponible per qualsevol rol o entorn.</li>
<li><span class="operativa">Nou domini:</span> Pitjant el bot&oacute; <span class="boton">Nou</span> s'obri la pantalla per donar d'alta un nou domini. </li> 
<li><span class="operativa">Edici&oacute; de domini:</span> Seleccionant un domini del llistat i pitjant el bot&oacute; <span class="boton">Editar</span>, s'obri la pantalla de domini amb la informaci&oacute; del domini.</li>
<li><span class="operativa">Consulta de dominis:</span> Seleccionant un domini del llistat i pitjant el bot&oacute; <span class="boton">Consultar</span>, s'obri la pantalla de domini amb la informaci&oacute; del domini en mode consulta.</li>
<li><span class="operativa">Eliminaci&oacute; de domini:</span> Seleccionant un domini del llistat i pitjant el bot&oacute; <span class="boton">Eliminar</span>, s'eliminar&agrave; el domini en el cas que no estigui associat a cap versi&oacute;.</li>
</ul>
Pitjant el bot&oacute; dret apareix un men&uacute; contextual amb les accions disponibles.<br>
Les opcions Edici&oacute; i Consulta no estan disponibles a la vegada.<br>
Fent doble click damunt qualsevol registre, es realitza l'acci&oacute; Edici&oacute; o Consulta, segons el rol i l'entorn.
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
Els camps que apareixen al llistat s&oacute;n els seg&uuml;ents:
<ul>
<li><span class="nombreCampo">Codi:</span> Identificador del dominio.</li>
<li><span class="nombreCampo">Descripci&oacute;:</span> Descripci&oacute; del domini.</li>
</ul>
</body>
</html>
