 <table width="100%" border="1">
  <tr> 
    <td width="22%"><div align="center"><strong>Camp</strong></div></td>
    <td width="78%"><div align="center"><strong>Descripci&oacute;</strong></div></td>
  </tr>
  <tr> 
    <td>Tipus</td>
    <td>Indica si el document &eacute;s un Formulari, Annex o Pagament</td>
  </tr>
  <tr> 
    <td>Identificador</td>
    <td>Identificador del document. Ha de ser únic entre els documents del tràmit.</td>
  </tr>
  <tr> 
    <td>Ordre de presentaci&oacute;</td>
    <td>Ordre de presentaci&oacute; en l'assistent</td>
  </tr>
  <tr> 
    <td>Model</td>
    <td>Indica el model del document. Tot document ha d'estar definit en
      el RDS mitjantçant un model / versi&oacute;. La versi&oacute; se particularitza 
      segons nivell d'autenticaci&oacute;.</td>
  </tr>
  <tr> 
    <td>Identificador PAD</td>
    <td>Si el document pot estat en la PAD s'indicar&agrave; l'identificador 
      intern de la PAD par a eixe document. En la tramitaci&oacute; es comprobar&agrave; 
      si l'usuari t&eacute; registrat aquest documento en la PAD i li donar&agrave; 
      opci&oacute; a reutilitzar-lo.</td>
  </tr>
  <tr> 
    <td>Presentar en Preregistre</td>
    <td>Per a formularis en cas que el tr&agrave;mit requereix que es realitze 
      de forma presencial la plataforma indicar&agrave; a l'usuari que ha d'imprimir 
      el formulari i portar-lo signat.</td>
  </tr>
  <tr> 
    <td>Mostrar com justificant</td>
    <td>Per a formularis es pot indicar que al finalitzar l'assistent un dels formularis s'utilitze com justificant (nom&eacute;s un dels formularis del tr&agrave;mit).</td>
  </tr>  
  <tr> 
    <td>Annexar a justificant</td>
    <td>Per a formularis es pot indicar que al finalitzar l'assistent el formulari s'annexe al justificant (no es pot utilitzar amb la anterior opci&oacute;).
    Per a preregistre no s'anexar&agrave; al justificant.</td>
  </tr>
  <tr> 
    <td height="61">Presentar</td>
    <td><p>Para annexes es pot indicar que l'usuari hagi d'adjuntar-lo telemàticament o bé lliurar-lo de forma presencial.</p></td>
  </tr>
  <tr> 
    <td>Extensions possibles</td>
    <td>Per a annexes indica la llista d'extensions possibles del document. Aquesta 
      llista estar&agrave; composta por sufixes de tres o quatre lletres separades per &quot;,&quot; 
      (Ej; txt,doc,zip)</td>
  </tr>
  <tr> 
    <td>Conversi&oacute; a PDF</td>
    <td>
    <p>
    Si s'habilita aquesta opci&oacute; el fitxer annexat es convertir&agrave; a PDF. Despr&eacute;s del proc&eacute;s 
    d'annexat es mostrar&agrave; un missatge indicant que s'ha realitzat aquesta conversi&oacute; i que es deu verificar 
    el contingut del document.
    </p>
    <p>
    No se convertiran totes l'extensions, nom&eacute;s: doc, docx y odt.
    </p>
    </td>
  </tr>
  <tr> 
    <td>Mida m&agrave;xima</td>
    <td>Para annexes indica la mida m&agrave;xima que pot tindre el documento
      (en Kb)</td>
  </tr>
  <tr> 
    <td>Url Plantilla</td>
    <td>Para annexes es pot indicar que el document ha d¡emplenar-se segons
      una plantilla. En aquest cas s'indicaria la URL de la plantilla. 
      La plataforma mostrar&agrave; un enllaç a aquesta URL. Es recommana que la 
      plantilla siga un fitxer zip per a evitar que el navegador obriga directamente
      fitxers tals com documents de word.</td>
  </tr>
  <tr> 
    <td>Instruccions descarregar plantilla</td>
    <td><p>En cas d'haver emplenat el camp anterior es pot indicar a l'usuari
        en el pas inicial &quot;Ha de saber&quot; que ha de descarregar-se la plantilla 
        abans d'iniciar el tr&agrave;mit.</p></td>
  </tr>
  <tr> 
    <td height="64">Compulsar</td>
    <td><p>Per a annexes es pot indicar que l'usuari ha de mostrar presencialment
        l'original del document per a la seua compulsa. Si existeix un document amb 
        aquestes caracter&iacute;stiques convertir&agrave; la tramitaci&oacute; en 
        presencial.<em></em></p></td>
  </tr>
  <tr> 
    <td height="61">Presentar Fotocòpia</td>
    <td><p>Per a annexes es pot indicar que l'usuari ha de mostrar presencialment una fotocòpia. Si existeix un document amb 
        aquestes caracter&iacute;stiques convertir&agrave; la tramitaci&oacute; en 
        presencial.<em></em></p></td>
  </tr>
  <tr> 
    <td height="42">Gen&eacute;rico</td>
    <td><p>Per a annexes permet que l'usuari adjunte m&eacute;s d'una instància 
        d'un document. Per a cada instància es permetr&agrave; que l'usuario
        introdueixi una descripci&oacute; personalitzada per a la instància.<em> 
        <br>
        </em>Si és gen&egrave;ric no es pot indicar que siga fotocòpia.</p></td>
  </tr>
  <tr> 
    <td height="23">Max. nombre doc. genèrics</td>
    <td>En el cas de gen&egrave;ric indica el m&agrave;xim nombre de 
      instàncies. </td>
  </tr>
  <tr> 
    <td height="23">Nom document</td>
    <td>Nom descriptiu del document</td>
  </tr>
  <tr> 
    <td height="23">Informaci&oacute; adicional</td>
    <td>Informaci&oacute; espec&iacute;fica del document.</td>
  </tr>
</table>
