 <table width="100%" border="1">
  <tr> 
    <td width="22%"><div align="center"><strong>Camp</strong></div></td>
    <td width="78%"><div align="center"><strong>Descripci&oacute;</strong></div></td>
  </tr>
  <tr> 
    <td>Identificador</td>
    <td>Identificador del domini</td>
  </tr>
  <tr> 
    <td height="30">Tipus</td>
    <td>
    Indica com es resol el domini: EJB, Webservice, consulta directa a BBDD o consulta a font de dades.<br/> 
	Un domini de tipus EJB o Webservice accedir&agrave; a una aplicació que compleixi amb el api d'integraci&oacute;. <br/>
	Un domini de tipus SQL consistir&agrave; a executar una consulta SQL sobre un datasource especificat.<br/> 
	Un domini de tipus font de dades consistir&agrave; a accedir a un conjunt de dades mantingudes pel gestor a trav&eacute;s de Bantelfront.<br/> 
    </td>
  </tr>
   <tr> 
    <td height="30">Cacheable</td>
    <td>Indica si la consulta al domini ha de ser cacheada entre diferents invocacions. S'haurà de marcar com cacheables els dominis que es prenguin com constants (províncies, municipis, taules de tipus, etc). Es forçarà el seu refresc una vegada al dia.</td>
  </tr>  
  <tr> 
    <td height="30">URL</td>
    <td>Seg&uacute;n el tipus de domini indicar&agrave;:<br>
      -  Domini EJB: url del servidor on esta ubicat el EJB (en cas de ser remot)<br>
      - Dominio Webservice: url del Web Service<br>
      - Dominio SQL: path JNDI de Datasource<br/>
      - Dominio Font de dades: no aplica<br/>
      Al formar la url es pot emprar la variable @backoffice.url@, que ser&agrave; reemplaçada segons el valor indicat en els fitxers de configuraci&oacute;.
      </td>      
  </tr>
  <tr> 
    <td height="30">SQL</td>
    <td>Per a tipus SQL s'indicar&agrave; la sentència SQL que resol el domini. Els par&agrave;metres de la consulta ser&agrave;n especificats amb &quot;?&quot;.<br/><br/>
    Per a tipus Font de dades s'indicar&aacute; una sentencia pseudoSQL per consultar una font de dades. El format d'aquesta consulta ha de ser: <br/><br/>
    <i> 
SELECT campo (, campo)* <br/>
FROM fuenteDatos <br/>
WHERE expresion ( [AND | OR] expresion ] )*<br/> 
ORDER BY campo<br/>
</i>
<br/> 
on expresion: <i>campo [= | LIKE] ?</i><br/><br/> 
Respecte al ORDER BY nom&eacute;s es pot indicar un camp. A m&eacute;s com tots els camps s&oacute;n de tipus cadena l'ordenaci&oacute; &eacute;s literal pel que si es vol crear un camp en la font de dades que permeti ordenar seqüencialment, millor usar lletres que nombres. 
    </td>
  </tr>
  <tr> 
    <td height="30">Nombre JNDI EJB</td>
    <td>Per a tipus EJB indicar&agrave; el JNDI de acc&eacute;s</td>
  </tr>
  <tr> 
    <td height="30">Localització EJB</td>
    <td>Per a tipus EJB indica si el EJB es troba en un servidor remot a la plataforma de tramitació. En cas de ser remot haurá d'indicar-se la url del servidor remot.</td>
  </tr>
  <tr> 
    <td>Autenticaci&oacute; expl&iacute;cita </td>
    <td>Per a tipus EJB/Webservice indica si s'ha de realitzar una autenticaci&oacute; 
      expl&iacute;cita (acc&eacute;s amb usuari diferent al que ha iniciat la 
      sessi&oacute; de tramitaci&oacute;): 
      <ul>
      		<li>No: el contenidor d'EJB ser&agrave; l'encarregat de traslladar l'autenticaci&oacute; (no v&agrave;lid per a webservices)</li>
      		<li>Amb usuari/password: s'utilitza l'usuari/password indicat per a autenticar la cridada </li>
	      	<li>Autenticaci&oacute; organisme : s'utilitza l'usuari/password suministrat pel plugin d'autenticaci&oacute; expl&iacute;ta de l'organisme per a autenticar la cridada</li>
      	</ul>   
     </td>
  </tr>
  <tr> 
    <td>Usuari/Password <br></td>
    <td>Per a tipus EJB/Webservice en cas de requerir una autenticaci&oacute; expl&iacute;cita s'indica l'usuari/password 
      amb la qual es realitza </td>
  </tr>
</table>
